https://github.com/okovtun/VBU_223
https://www.youtube.com/watch?v=-RMxAgeHN8I&list=PLeqyOOqxeiIP8_LnlYyJ3GtYHqBoxiH3c

TOREAD:
https://github.com/okovtun/VBU_223/blob/master/NumericSystems.pdf

Install:
https://docs.microsoft.com/en-us/sysinternals/downloads/zoomit

TODO:
1. Написать программу, которая возводит указанное число в указанную степень.
   Основание и показатель степени вводятся с клавиатуры;
2. Вывести на экран таблицу ASCII-символов по 16 символов в строке,
   символы должны разделяться пробелом;
3. Вывести на экран ряд Фибоначчи, до указанного предела;
4. Вывести на экран заданное количество чисел из ряда Фибоначчи;
-----------------------------------------------------------------
5. Вывести на экран ряд простых чисел до заданного предела.
   Простым называется число, которое делится только на себя и на 1;
6. Вывести на экран таблицу умножения;
7. Вывести на экран таблицу Пифагора;

DONE:
1. Написать программу, в которую пользователь вводит целое число,	DONE
   и программа говорит это число палиндром, или НЕ палиндром.
   Палидром - это число, которое читается одинаково как слева направо,
   так и справа налево, например: 121, 1221, 12321.
2. Пользователь вводит с клавиатуры номер автобусного билета.
   Программа должна сказать, это счастливый билет, или обычный билет.
   Счастливым называется билет, у которого сумма трех старших разрядов номера
   равна сумме трех младших разрядов номера, например: 322007.
3. Написать программу Shooter, которая по нажатой клавише определяет действие ползователя:
	w - вперед
	s - назад
	a - влево
	d - вправо
	Space - прыжок
	Enter - огонь
	
DONE:
Написать программу калькулятор, которая принимает выражение вида:
	2+3
И выдает результат вида:
	2+3=5
----------------------------------
1)
int i = 3;
i = i++ + ++i;
cout << i << endl;

2)
int i = 3;
i = i++ + 1 + ++i * 2;
cout << i << endl;

3)
int i = 3;
i = i++ + 1 + (++i *= 2);
cout << i << endl;

4)
int i = 3;
i += i++ + 1 + (++i *= 2);
cout << i << endl;

5)
int i = 3;
i *= i++ + 1 + (++i += 2);
cout << i << endl;

------------------------------------------------------------------------------

DONE:
1. Выучить конспект!!!!!!
2. Выучить: https://github.com/okovtun/VBU_223/blob/master/DataTypes.pdf
3. Решить все задачи из файла: https://github.com/okovtun/VBU_223/blob/master/VariablesTask.pdf

TOREAD:
https://cplusplus.com/
https://en.cppreference.com/w/

Установка Visual Studio:
https://www.youtube.com/watch?v=4Kdn2M5sACE

TODO:
0. Выучить теорию!!!!!!!!!!!!!!!!!!!
1. Вывести в консоль стишок "В лесу родилась Ёлочка".
   Стишок должен быть выровнен по середине окна консоли,
   и его куплеты должны быть разделены пустой строкой;