https://github.com/okovtun/VBU_223
https://www.youtube.com/watch?v=-RMxAgeHN8I&list=PLeqyOOqxeiIP8_LnlYyJ3GtYHqBoxiH3c

TOREAD:
https://github.com/okovtun/VBU_223/blob/master/NumericSystems.pdf

TODO:

Написать программу калькулятор, которая принимает выражение вида:
	2+3
И выдает результат вида:
	2+3=5
----------------------------------
1)
int i = 3;
i = i++ + ++i;
cout << i << endl;

2)
int i = 3;
i = i++ + 1 + ++i * 2;
cout << i << endl;

3)
int i = 3;
i = i++ + 1 + (++i *= 2);
cout << i << endl;

4)
int i = 3;
i += i++ + 1 + (++i *= 2);
cout << i << endl;

5)
int i = 3;
i *= i++ + 1 + (++i += 2);
cout << i << endl;

------------------------------------------------------------------------------

DONE:
1. Выучить конспект!!!!!!
2. Выучить: https://github.com/okovtun/VBU_223/blob/master/DataTypes.pdf
3. Решить все задачи из файла: https://github.com/okovtun/VBU_223/blob/master/VariablesTask.pdf

TOREAD:
https://cplusplus.com/
https://en.cppreference.com/w/

Установка Visual Studio:
https://www.youtube.com/watch?v=4Kdn2M5sACE

TODO:
0. Выучить теорию!!!!!!!!!!!!!!!!!!!
1. Вывести в консоль стишок "В лесу родилась Ёлочка".
   Стишок должен быть выровнен по середине окна консоли,
   и его куплеты должны быть разделены пустой строкой;