https://github.com/okovtun/VBU_223
https://www.youtube.com/watch?v=-RMxAgeHN8I&list=PLeqyOOqxeiIP8_LnlYyJ3GtYHqBoxiH3c

TODO:
Написать перегруженные функции для работы с одномерными и двумерными массивами
типа int, float, double и char:
	??? Sum(???);	//ВОЗВРАЩАЕТ сумму элементов массива		DONE
	??? Avg(???);	//ВОЗВРАЩАЕТ среднее-арифметическое элементов массива
	??? minValueIn(???);	//ВОЗВРАЩАЕТ минимальное значение из массива
	??? maxValueIn(???);	//ВОЗВРАЩАЕТ максимальное значение из массива
	??? shiftLeft(???);		//циклически сдвигает массив на заданное число элементов влево
	??? shiftRight(???);	//циклически сдвигает массив на заданное число элементов вправо
	??? Sort(???);			//сортирует массив в порядке возрастания
У элементов массива float должен быть один знак после запятой (в дробной части).

DONE:
В проект Functions добавть функцию ??? Power(???), которая возводит указанное число в указанную степень.

DONE:
1. Есть массив из десяти элементов, проинициализированный при объявлении значениями
	1	2	3	4	5	6	7	8	9	10
   необходимо выполнить циклический сдвиг этого массива на заданное число элементов влево.
	1	2	3	4	5	6	7	8	9	10
	2	3	4	5	6	7	8	9	10	1
	3	4	5	6	7	8	9	10	1	2
	4	5	6	7	8	9	10	1	2	3
	5	6	7	8	9	10	1	2	3	4
2. Выполнить циклический сдвиг массива на заданное число элементов вправо;
3. Пользователь вводит с клавиатуры десятичное число (dec), нужно перевести это число в двоичную систему счисления (bin);
4. Пользователь вводит с клавиатуры десятичное число (dec), нужно перевести это число в шестнадцатеричную системы счисления (hex);
	Алгоритм перевода dec в bin и hex здесь:https://github.com/okovtun/VBU_223/blob/master/NumericSystems.pdf

TOREAD:
https://github.com/okovtun/VBU_223/blob/master/NumericSystems.pdf

Install:
https://docs.microsoft.com/en-us/sysinternals/downloads/zoomit

DONE:
1. https://github.com/okovtun/BV_011/blob/master/ControlStructures/Geometria/Task/Geometria1.txt;
2. https://github.com/okovtun/BV_011/blob/master/ControlStructures/Geometria/Task/ChessBoard.jpg;
3. https://github.com/okovtun/BV_011/blob/master/ControlStructures/Geometria/Task/HardChess.jpg;
4. Залить на GitHub 3 проекта на выбор;

DONE:
1. Написать программу, которая возводит указанное число в указанную степень.	DONE
   Основание и показатель степени вводятся с клавиатуры;
2. Вывести на экран таблицу ASCII-символов по 16 символов в строке,				DONE
   символы должны разделяться пробелом;
3. Вывести на экран ряд Фибоначчи, до указанного предела;			DONE
4. Вывести на экран заданное количество чисел из ряда Фибоначчи;	DONE

-----------------------------------------------------------------
5. Вывести на экран ряд простых чисел до заданного предела.			DONE
   Простым называется число, которое делится только на себя и на 1;
6. Вывести на экран таблицу умножения;								DONE
7. Вывести на экран таблицу Пифагора;								DONE

DONE:
1. Написать программу, в которую пользователь вводит целое число,	DONE
   и программа говорит это число палиндром, или НЕ палиндром.
   Палидром - это число, которое читается одинаково как слева направо,
   так и справа налево, например: 121, 1221, 12321.
2. Пользователь вводит с клавиатуры номер автобусного билета.
   Программа должна сказать, это счастливый билет, или обычный билет.
   Счастливым называется билет, у которого сумма трех старших разрядов номера
   равна сумме трех младших разрядов номера, например: 322007.
3. Написать программу Shooter, которая по нажатой клавише определяет действие ползователя:
	w - вперед
	s - назад
	a - влево
	d - вправо
	Space - прыжок
	Enter - огонь
	
DONE:
Написать программу калькулятор, которая принимает выражение вида:
	2+3
И выдает результат вида:
	2+3=5
----------------------------------
1)
int i = 3;
i = i++ + ++i;
cout << i << endl;

2)
int i = 3;
i = i++ + 1 + ++i * 2;
cout << i << endl;

3)
int i = 3;
i = i++ + 1 + (++i *= 2);
cout << i << endl;

4)
int i = 3;
i += i++ + 1 + (++i *= 2);
cout << i << endl;

5)
int i = 3;
i *= i++ + 1 + (++i += 2);
cout << i << endl;

------------------------------------------------------------------------------

DONE:
1. Выучить конспект!!!!!!
2. Выучить: https://github.com/okovtun/VBU_223/blob/master/DataTypes.pdf
3. Решить все задачи из файла: https://github.com/okovtun/VBU_223/blob/master/VariablesTask.pdf

TOREAD:
https://cplusplus.com/
https://en.cppreference.com/w/

Установка Visual Studio:
https://www.youtube.com/watch?v=4Kdn2M5sACE

TODO:
0. Выучить теорию!!!!!!!!!!!!!!!!!!!
1. Вывести в консоль стишок "В лесу родилась Ёлочка".
   Стишок должен быть выровнен по середине окна консоли,
   и его куплеты должны быть разделены пустой строкой;